#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>
        
```


```
        
</details>
        
#### Terraform Plan 📖``
        
<details><summary>Show Plan</summary>
        
```

terraform
null_resource.default: Refreshing state... [id=2182437570605761994]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.default will be created
  + resource "google_cloud_run_service" "default" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "frontend"
      + project                    = "gde-ihommani"
      + status                     = (known after apply)

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-west1-docker.pkg.dev/gde-ihommani/to-delete/frontend:latest"
                  + name  = (known after apply)
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_project_service.project will be created
  + resource "google_project_service" "project" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "gde-ihommani"
      + service            = "run.googleapis.com"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
        
</details>
        
*Pusher: @ihommani, Action: `pull_request`, Working Directory: ``, Workflow: `Infrastructure main workflow`*